In [13]:
import pandas as pd
import requests
from datetime import datetime
from sqlalchemy import create_engine
import os
uri = os.environ.get('URI')


url = 'https://api.blockchain.info/charts/transactions-per-second?timespan=all&sampled=false&metadata=false&cors=true&format=json'

resp = requests.get(url)

In [14]:
data = pd.DataFrame(resp.json()["values"])

In [15]:
# from timestamp to date
data['x'] = [datetime.utcfromtimestamp(x).strftime('%Y-%m-%d %H:%M:%S') for x in data['x']]
data['x'] = pd.to_datetime(data['x'])

In [16]:
data.head()

                    x         y
0 2016-06-11 00:00:00  1.983333
1 2016-06-11 00:15:00  1.966667
2 2016-06-11 00:30:00  1.900000
3 2016-06-11 00:45:00  2.283333
4 2016-06-11 01:00:00  2.083333

In [17]:
data.columns = ["date", "transactions"]

In [18]:
data.head()

                 date  transactions
0 2016-06-11 00:00:00      1.983333
1 2016-06-11 00:15:00      1.966667
2 2016-06-11 00:30:00      1.900000
3 2016-06-11 00:45:00      2.283333
4 2016-06-11 01:00:00      2.083333

In [19]:
data['date'] = data['date'].dt.round('H')
grouped_data = data.groupby('date').sum().reset_index()

In [22]:
grouped_data.head()

                 date  transactions
0 2016-06-11 00:00:00          5.85
1 2016-06-11 01:00:00          6.05
2 2016-06-11 02:00:00          9.05
3 2016-06-11 03:00:00          6.05
4 2016-06-11 04:00:00         12.65

In [23]:
# switched from DataFrame to pandas.series (which is just one/each column of dataframe)
grouped_data = grouped_data.set_index('date')
grouped_data = grouped_data['transactions']
grouped_data.head()

date
2016-06-11 00:00:00     5.85
2016-06-11 01:00:00     6.05
2016-06-11 02:00:00     9.05
2016-06-11 03:00:00     6.05
2016-06-11 04:00:00    12.65
Name: transactions, dtype: float64

In [25]:
type(grouped_data)

pandas.core.series.Series